schreibfaul1/ESP32-MiniWebRadio/src/settings.h
#ifdef SPI_DISPLAY
    #undef TFT_CONTROLLER
    #undef TFT_ROTATION
    #undef TP_CONTROLLER
    #undef TP_ROTATION
    #undef DISPLAY_INVERSION
    #if (SPI_DISPLAY == 1)
        #define TFT_CONTROLLER    0
        #define TFT_ROTATION      0
        #define TP_CONTROLLER     1
        #define TP_ROTATION       2
        #define DISPLAY_INVERSION 0
    #endif
    #if (SPI_DISPLAY == 2)
        #define TFT_CONTROLLER    5 // ILI9488 or ST7796
        #define TFT_ROTATION      0
        #define TP_CONTROLLER     1 // 3.5" or 4.0"
        #define TP_ROTATION       2
        #define DISPLAY_INVERSION 0
    #endif
    #if (SPI_DISPLAY == 3)
        #define TFT_CONTROLLER    5 // ILI9488 or ST7796
        #define TFT_ROTATION      0
        #define TP_CONTROLLER     8 // FT6x63
        #define TP_ROTATION       1
        #define DISPLAY_INVERSION 1
    #endif
    #if CONFIG_IDF_TARGET_ESP32S3
    // Digital I/O used
        #define TFT_CS             45  // not used for waveshare 3.5 withes8311 but -1 does not work, set to unused port
        #define TFT_DC              3
        #define TFT_BL              6 // at -1 the brightness menu is not displayed
        #define TP_IRQ             -1  // For Waveshare 3.5 w/ES8311, use EXI02
        #define TP_CS              41  // For Waveshare 3.5 w/ES8311, use EXI02
        #define SD_MMC_D0           9
        #define SD_MMC_CLK         11
        #define SD_MMC_CMD         10
        #define IR_PIN             42 // Set to unused port// IR Receiver (if available)
        #define TFT_MOSI           1 // TFT and TP (FSPI)
        #define TFT_MISO           2  // TFT and TP (FSPI)
        #define TFT_SCK            5 // TFT and TP (FSPI)
        #define I2S_DOUT           14  
        #define I2S_BCLK           13  // SCLK
        #define I2S_LRC            15
        #define I2S_MCLK           12
        #define BT_EMITTER_RX      -1 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      -1 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    -1 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT -1 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA             8 // I2C, dala line for capacitive touchpadand and light sensor (-1 if not available)
        #define I2C_SCL             7 // I2C, clock line for capacitive touchpadand and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif                            // CONFIG_IDF_TARGET_ESP32S3

    #if CONFIG_IDF_TARGET_ESP32P4
        #define TFT_CS             26
        #define TFT_DC             3
        #define TFT_BL             4 // at -1 the brightness menu is not displayed
        #define TP_IRQ             5
        #define TP_CS              2
        #define SD_MMC_D0          39
        #define SD_MMC_D1          40
        #define SD_MMC_D2          41
        #define SD_MMC_D3          42
        #define SD_MMC_CLK         43
        #define SD_MMC_CMD         44
        #define IR_PIN             32 // IR Receiver (if available)
        #define TFT_MOSI           20 // TFT and TP (FSPI)
        #define TFT_MISO           21 // TFT and TP (FSPI)
        #define TFT_SCK            22 // TFT and TP (FSPI)
        #define I2S_DOUT           23
        #define I2S_BCLK           24
        #define I2S_LRC            25
        #define I2S_MCLK           -1
        #define BT_EMITTER_RX      27 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    29 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 30 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            7  // I2C, dala line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            8  // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        33 // onboard amplifier (-1 if not available)
    // free pins 46, 47, 48, 49, 50, 51, 52
    #endif // CONFIG_IDF_TARGET_ESP32P4
#endif

// // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [480x320] ESP32-S3 Waveshare Touch_LCD_3.5 with onboard ES8311   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
  #ifdef ESP32_S3_Touch_LCD_3_5
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 5  // ST7796
        #undef TFT_ROTATION
        #define TFT_ROTATION 0  // USB connector on the right, PCB LOGO upright
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 8  // FT6336
        #undef TP_ROTATION
        #define TP_ROTATION 1   // TP is opposite of display
        #undef DISPLAY_INVERSION
        #define DISPLAY_INVERSION 1
    // Digital I/O used
        #define TFT_CS             38  // CS hardwired to ground on waveshare 3.5 with es8311.  -1 does not work, set to unused port like 38
        #define TFT_DC              3
        #define TFT_BL              6  // at -1 the brightness menu is not displayed
        #define TFT_RST             1  // For Waveshare 3.5 w/ES8311, use 1 for EXIO1
        #define SD_MMC_D0           9
        #define SD_MMC_CLK         11
        #define SD_MMC_CMD         10
        #define IR_PIN             -1  // Set to unused port// IR Receiver -1 does not work, set to unused pin like 39
        #define TFT_MOSI            1  // TFT and TP (FSPI)
        #define TFT_MISO            2  // TFT and TP (FSPI)
        #define TFT_SCK             5  // TFT and TP (FSPI)
        #define I2S_DOUT           16  // Schematic wrong, 16 is actually out, 14 is in. Example prgrams work.
        #define I2S_BCLK           13  // SCLK
        #define I2S_LRC            15
        #define I2S_MCLK           12
        #define BT_EMITTER_RX      -1 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      -1 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    -1 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT -1 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA             8 // I2C, data line for capacitive touchpad and and light sensor (-1 if not available)
        #define I2C_SCL             7 // I2C, clock line for capacitive touchpad and and light sensor (-1 if not available)
        #define AMP_ENABLED         7 //7 //exio7 on TCA9554 use value = 7 // onboard amplifier (-1 if not available)
    #endif     
#endif

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 SUNTON   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_8048S070
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

