schreibfaul1/ESP32-MiniWebRadio/src/settings.h
        #define I2S_DOUT 20  // 
        #define I2S_BCLK 15
        #define I2S_LRC  43
        #define I2S_MCLK -1 // important, don't change!

        #define IR_PIN              6  // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins

        #define TFT_BL      -1 // same as RGB_PINS.bl
        #define AMP_ENABLED -1 // control pin for extenal amplifier (if available)

        #define I2C_SDA 8 // I2C dala line for capacitive touchpad  (-1 if not used)
        #define I2C_SCL 9 // I2C clock line for capacitive touchpad (-1 if not used)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DSI-DISPLAY [1024x600] ESP32-P4 WAVESHARE 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef ESP32_P4_WIFI6_TOUCH_LCD7_7B
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 8
        #undef TFT_ROTATION
        #define TFT_ROTATION 0
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Timing DSI_TIMING = {.h_res = 1024, .v_res = 600, .pixel_clock_mhz = 52, .hsync_pulse_width = 10, .hsync_back_porch = 160, .hsync_front_porch = 160, .vsync_pulse_width = 1, .vsync_back_porch = 23, .vsync_front_porch = 22, .lane_bit_rate_mbps = 900};

        #define TP_IRQ -1

        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S ext. DAC
        #define I2S_DOUT 2
        #define I2S_BCLK 3
        #define I2S_LRC  4
        #define I2S_MCLK -1

    // I2S onboard DAC ES8311
    // #define I2S_DOUT  9 // ES8311 DSDIN
    // #define I2S_BCLK 12 // ES8311 SCLK
    // #define I2S_LRC  10 // ES8311 LRCK
    // #define I2S_MCLK 13 // ES8311 MCLK
    // #define I2S_DIN  11 // ES8311 DOUT (microphone input)

        #define IR_PIN             5 // IR Receiver (if available)
        #define BT_EMITTER_RX      28
        #define BT_EMITTER_TX      29
        #define BT_EMITTER_LINK    30
        #define BT_EMITTER_MODE    31
        #define BT_EMITTER_CONNECT 34

        #define LCD_RESET   33
        #define TFT_BL      32 //
        #define AMP_ENABLED 53 // control pin for extenal amplifier

        #define I2C_SDA 7 // I2C dala line for capacitive touchpad
        #define I2C_SCL 8 // I2C clock line for capacitive touchpad
    #endif
#endif

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DSI-DISPLAY [1024x600] ESP32-P4 GUITION 7"   📌📌📌 JC1060P470
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef JC1060P470
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 9
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Timing DSI_TIMING = {.h_res = 1024, .v_res = 600, .pixel_clock_mhz = 52, .hsync_pulse_width = 40, .hsync_back_porch = 160, .hsync_front_porch = 160, .vsync_pulse_width = 10, .vsync_back_porch = 23, .vsync_front_porch = 12, .lane_bit_rate_mbps = 750};

        #define TP_IRQ -1

        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S external DAC
        #define I2S_DOUT 2
        #define I2S_BCLK 3
        #define I2S_LRC  4
        #define I2S_MCLK -1

        // I2S onboard DAC ES8311
        // #define I2S_DOUT  9 // ES8311 DSDIN
        // #define I2S_BCLK 12 // ES8311 SCLK
        // #define I2S_LRC  10 // ES8311 LRCK
        // #define I2S_MCLK 13 // ES8311 MCLK

        #define IR_PIN             5 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1
        #define BT_EMITTER_TX      -1
        #define BT_EMITTER_LINK    -1
        #define BT_EMITTER_MODE    -1
        #define BT_EMITTER_CONNECT -1

        #define LCD_RESET   27 //
        #define TFT_BL      23 //
        #define AMP_ENABLED 20 // control pin for onboard amplifier

        #define I2C_SDA 7 // I2C dala line for capacitive touchpad
        #define I2C_SCL 8 // I2C clock line for capacitive touchpad
    #endif
#endif

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌 DSI-DISPLAY [480x800] ESP32-P4 GUITION 4.3" 📌📌📌 JC4880P443
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32P4 == 1)
    #ifdef JC4880P443
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 10
        #undef TFT_ROTATION
        #define TFT_ROTATION 3
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 2

